src/Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>ДоговорыКонтрагентов</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>гф_Сезон</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.КоллекцииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговора</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/гф_БлокировкаКонтрагентовКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс
// #wortmann {
// #Формирование установки блокировки договора с описанием вида блокировки при проведении документа блокировка
// описание вставки
// Галфинд(Просто) Боцманова 2022/09/06
//
// Осуществляет заполненнение данных документа.
//
// Параметры:
//   Источник - ДокументОбъект - Обрабатываемый объект.
//   Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//   РежимПроведения - - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.

Процедура гф_УстановкаБлокировкиДоговоровКонтрагентаОбработкаПроведения1(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ЗначениеЗаполнено(Источник.ДоговорКонтрагента) Тогда 
		Если  НЕ Источник.Исключения Тогда
			Если Источник.Заблокирован Тогда 
				ДоговорКонтрагента = Источник.ДоговорКонтрагента;
				ДоговорДляИзменения = ДоговорКонтрагента.ПолучитьОбъект(); 
				Если СтрНайти(ДоговорДляИзменения.гф_ОписаниеБлокировки,Источник.ВидБлокировки)=0 тогда
					ДоговорДляИзменения.гф_Заблокирован = Истина; 
					Если  НЕ ЗначениеЗаполнено(ДоговорДляИзменения.гф_ОписаниеБлокировки) Тогда
						ДоговорДляИзменения.гф_ОписаниеБлокировки  = Источник.ВидБлокировки;
					Иначе 
						ДоговорДляИзменения.гф_ОписаниеБлокировки  = ДоговорДляИзменения.гф_ОписаниеБлокировки
						+ "; " + Источник.ВидБлокировки;
					КонецЕсли;
					ДоговорДляИзменения.Записать();  
				КонецЕсли;
			Иначе
				ДоговорКонтрагента = Источник.ДоговорКонтрагента;
				УстановкаБлокировкиДоговораКонтрагента(ДоговорКонтрагента, Источник);			
			КонецЕсли; 
		КонецЕсли; 
	Иначе
		ЗаполнениеБлокировкиПоВсеДоговорамКонтрагента(Источник);		
	КонецЕсли;
	
КонецПроцедуры   

 #КонецОбласти  
 
#Область ДополнительныеПроцедурыИФункции  

// #wortmann {
// #Формирование установки блокировки договора с описанием вида блокировки при проведении документа блокировка
// описание вставки
// Галфинд(Просто) Боцманова 2022/09/07
//
// Осуществляет заполненнение данных документа.
//
// Параметры:
//   Источник,ДоговорКонтрагента
 Процедура УстановкаБлокировкиДоговораКонтрагента(ДоговорКонтрагента, Источник)
	
	ДоговорДляИзменения = ДоговорКонтрагента.ПолучитьОбъект(); 
	ЗначенияБлокировки  =  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок
	(ДоговорДляИзменения.гф_ОписаниеБлокировки, "; ");
	Если ЗначенияБлокировки.Количество()  = 1  Тогда
		ДоговорДляИзменения.гф_Заблокирован = Ложь;
		ДоговорДляИзменения.гф_ОписаниеБлокировки  = "";
	Иначе
		ДоговорДляИзменения.гф_ОписаниеБлокировки  = СтрЗаменить
		(ДоговорДляИзменения.гф_ОписаниеБлокировки, Источник.ВидБлокировки , "");
		Если СтрНайти(ДоговорДляИзменения.гф_ОписаниеБлокировки , "; ;") <> 0 Тогда
			ДоговорДляИзменения.гф_ОписаниеБлокировки  = СтрЗаменить(ДоговорДляИзменения.гф_ОписаниеБлокировки , "; ;", ";");
		КонецЕсли;
		Если СтрНайти(ДоговорДляИзменения.гф_ОписаниеБлокировки , "; ") <> 0 Тогда
			ДоговорДляИзменения.гф_ОписаниеБлокировки  = СтрЗаменить(ДоговорДляИзменения.гф_ОписаниеБлокировки , "; " , "");
		КонецЕсли;
			
	КонецЕсли;
	
	ДоговорДляИзменения.Записать();	  
	
КонецПроцедуры

// #wortmann {
// #Формирование установки блокировки договора с описанием вида блокировки по всем договорам контрагента
// описание вставки
// Галфинд(Просто) Боцманова 2022/09/07
// Параметры:
//   Источник - ДокументОбъект - Обрабатываемый объект. 
Процедура ЗаполнениеБлокировкиПоВсеДоговорамКонтрагента(Источник)  
	
	Запрос  =  Новый Запрос;
	Запрос.Текст  =  
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Партнер  =  &Контрагент
	|	И ДоговорыКонтрагентов.Организация  =  &Организация";
	Если НЕ Значениезаполнено(Источник.Организация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ДоговорыКонтрагентов.Организация  =  &Организация", "");
	КонецЕсли;
	Запрос.УстановитьПараметр("Контрагент", Источник.Партнер);
	Запрос.УстановитьПараметр("Организация", Источник.Организация);
	
	РезультатЗапроса  =  Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи  =  РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Если НЕ Источник.Исключения Тогда
		Если Источник.Заблокирован Тогда 
			ДоговорКонтрагента = ВыборкаДетальныеЗаписи.Ссылка;
			ДоговорДляИзменения = ДоговорКонтрагента.ПолучитьОбъект();
			Если СтрНайти(ДоговорДляИзменения.гф_ОписаниеБлокировки,Источник.ВидБлокировки)=0 тогда
			ДоговорДляИзменения.гф_Заблокирован = Истина; 
			Если  НЕ ЗначениеЗаполнено(ДоговорДляИзменения.гф_ОписаниеБлокировки) Тогда
				ДоговорДляИзменения.гф_ОписаниеБлокировки  = Источник.ВидБлокировки;
			Иначе 
				ДоговорДляИзменения.гф_ОписаниеБлокировки  = ДоговорДляИзменения.гф_ОписаниеБлокировки 
				+ "; " + Источник.ВидБлокировки;
			КонецЕсли;
			ДоговорДляИзменения.Записать(); 
			КонецЕсли;
		Иначе
			ДоговорКонтрагента = ВыборкаДетальныеЗаписи.Ссылка;
			УстановкаБлокировкиДоговораКонтрагента(ДоговорКонтрагента, Источник);				
		КонецЕсли;
	КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры 

 #КонецОбласти
